routes/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "Brad Trick"], ["email", "brad@gmail.com"]]
---
    def create
        user = User.new(params.require(:user).permit(:name, :email))
        if user.save